In [ ]:
print("Hello World!")
print("Hello Again")
print("I like typing this.")
print("This is fun.")
print('Yay! Printing.')
print("I'd much rather you 'not'.")
print('I "said" do not touch this.')

In [ ]:
print('Hello " World!')

In [ ]:
print("hello world")

In [ ]:
print("Hello World")

In [ ]:
# A comment, this is so you can read your program later.
# Anything after the # is ignored by pyhton.
# hhhhhhhh

print("I could have code like this.")  # and the comment after is ignored

# You can also use a comment to "disable" or comment out a piece of code:
# print ("This won't run.")

print("This will run.")

In [ ]:
print("hellow") #world")

In [ ]:
print("I will now count my chickens:")

print("Hens", 25 + 30 / 6)
print("Rosters", 100 - 25 * 3 % 4)

print("Now I will count the eggs:")

print(round(3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6))

print("Is it true that 3 + 2 < 5 - 7?")

print(3 + 2 < 5 - 7)

print("What is 3 + 2?", 3 + 2)
print("What is 5 - 7?", 5 - 7)

print("Oh, that's why it's False.")

print("How about some more.")

print("It is greater?", 5 > -2)
print("It is greater or equal?", 5 >= -2)
print("It is less or equal?", 5 <= -2)

In [ ]:
25 + 30 / 6

In [ ]:
100 - 25  *  3   % 4

In [ ]:
3   % 4

In [ ]:
3 + 2 < 13 - 7

In [ ]:
print("It is less or equal?", -5 <= -2)

In [ ]:
cars = 100
space_in_a_car = 4.01
drivers = 30
passengers = 90
cars_not_driven = cars - drivers
cars_driven = drivers
carpool_capacity = cars_driven * space_in_a_car
average_passengers_per_car = passengers / cars_driven

print("There are", cars, "cars available.")
print("There are only", drivers, "drivers available.")
print("There will be", cars_not_driven, "empty cars today")
print("We can transport", carpool_capacity, "people today.")
print("We have", passengers, "to carpool today.")
print("We need to put about", average_passengers_per_car, "in each car.")

In [ ]:
my_name = 'Zed A. Shaw'
my_age = 35  # not a lie
my_height = 74  # inches
my_weight = 180  # lbs
my_eyes = 'Blue'
my_teeth = 'White'
my_hair = 'Brown'

print(f"Let's talk about {my_name}.")
print(f"He's {my_height} inches tall.")
print(f"He's {my_weight} pounds heavy.")
print("Actually that's not too heavy.")
print(f"He's got {my_eyes} eyes and {my_hair} hair.")
print(f"His teeth are usually {my_teeth} depending on the coffee.")

# this line is tricky, try to get it exactly right
total = my_age + my_height + my_weight
print(f"If I add {my_age}, {my_height}, and {my_weight} I get {total}.")

In [ ]:
types_of_people = 10
x = f"There are {types_of_people} types of people."

binary = "binary"
do_not = "don't"
y = f"Those who know {binary} and those who {do_not}."

print(x)
print(y)

print(f"I said: {x}")
print(f"I also said : '{y}'.")

hilarious = False
joke_evaluation = "Isn't that joke so funny?! {}"

print(joke_evaluation.format("xxx"))

w = "This is the left side of..."
e = "a string with a right side."

print(w + ' '+ e)

In [ ]:
print("Mary had a little lamb.")
print("Its fleece was white as {}.".format('snow'))
print("And everywhere that Mary went.")
print("xxx" * 10)  # what'd that do?

end1 = "C"
end2 = "h"
end3 = "e"
end4 = "e"
end5 = "s"
end6 = "e"
end7 = "B"
end8 = "u"
end9 = "r"
end10 = "g"
end11 = "e"
end12 = "r"

print(end1 + end2 + end3 + end4 + end5 + end6, end=' ')
print(end7 + end8 + end9 + end10 + end11 + end12)

In [ ]:
end = 5

In [ ]:
end

In [ ]:
formatter = "{} {} {} {}"

print(formatter.format(1, 2, 3, 4))
print(formatter.format("one", "two", "three", "four"))
print(formatter.format(True, False, False, True))
print(formatter.format(formatter, formatter, formatter, formatter))
print(formatter.format("Try your",
                       "Own text here",
                       "Maybe a poem",
                       "Or a song about fear"
                       ))

In [ ]:
# Here's some new strange stuff, remember type it exactly.

days = "Mon Tue Wed Thu Fri Sat Sun"
months = "Jan\nFeb\nMar\nApr\nMay\nJun\nJul\nAug"

print("Here are the days:", days)
print("Here are the months: ", months)

print("""
There's something going on here.
With the three double-quotes.
We'll be able to type as much as we like.
Even 4 lines if we want, or 5, or 6.
""")

In [ ]:
tabby_cat = "\tI'm tabbed in."
persian_cat = "I'm split\non a line."
backslash_cat = "I'm \\n a \\ cat."

fat_cat = """
I'll do a list:
\t* Cat food
\t* Fishes
\t* Catnip\n\t* Grass
"""

print(tabby_cat)
print(persian_cat)
print(backslash_cat)
print(fat_cat)

In [ ]:
print("How old are you?" )
age = input()
print("How tall are you?")
height = input()
print("How much do you weight?")
weight = input()

print(f"So, you're {age} old, {height} tall and {weight} heavy.")

In [ ]:
age = input("How old are you? ")
height = input("How tall are you? ")
weight = input("How much do you weight? ")

print(f"So, you're {age} old, {height} tall and {weight} heavy.")

In [ ]:
from sys import argv

# read the WYSS section for how to run this
first, second, third = argv

#print("The script is called:", script)
print("Your first variable is:", first)
print("Your second variable is:", second)
print("Your third variable is:", third)

In [9]:
from sys import argv

script, user_named = argv
prompt = ''

print(f"Hi {user_name}, I'm the {script} script.")
print("I'd like to ask you a few questions.")
print(f"Do you like me {user_name}?")
likes = input(prompt)

print(f"Where do you live {user_name}?")
lives = input(prompt)

print("What kind of computer do you have?")
computer = input(prompt)

print(f"""
Alright, so you said {likes} about liking me.
You live in {lives}. Not sure where that is.
And you have a {computer} computer. Nice.
""")

Hi -f, I'm the /home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py script.
I'd like to ask you a few questions.
Do you like me -f?
dd
Where do you live -f?
d
What kind of computer do you have?


Alright, so you said dd about liking me.
You live in d. Not sure where that is.
And you have a  computer. Nice.

In [16]:
from sys import argv

script,xxx, filename = argv

txt = open(filename)

print(f"Here's your file {filename}:")
print(txt.read())

print("Type the filename again:")
file_again = input("> ")

txt_again = open(file_again)

print(txt_again.read())

Here's your file /home/nbuser/.local/share/jupyter/runtime/kernel-0c4f528c-33b1-4394-ba18-0b9b0aa78cd1.json:
{
  "shell_port": 48549,
  "iopub_port": 55611,
  "stdin_port": 47187,
  "control_port": 53661,
  "hb_port": 38727,
  "ip": "127.0.0.1",
  "key": "de31e398-3a0fc7f8b536c9111a096bdf",
  "transport": "tcp",
  "signature_scheme": "hmac-sha256",
  "kernel_name": ""
}
Type the filename again:
> /home/nbuser/.local/share/jupyter/runtime/kernel-0c4f528c-33b1-4394-ba18-0b9b0aa78cd1.json
{
  "shell_port": 48549,
  "iopub_port": 55611,
  "stdin_port": 47187,
  "control_port": 53661,
  "hb_port": 38727,
  "ip": "127.0.0.1",
  "key": "de31e398-3a0fc7f8b536c9111a096bdf",
  "transport": "tcp",
  "signature_scheme": "hmac-sha256",
  "kernel_name": ""
}

In [20]:
print (txt)

<_io.TextIOWrapper name='/home/nbuser/.local/share/jupyter/runtime/kernel-0c4f528c-33b1-4394-ba18-0b9b0aa78cd1.json' mode='r' encoding='UTF-8'>

In [25]:
xxx = open('ex15_sample.txt')

yyy =xxx.read()
yyy

'This is stuff I typed into a file.\nIt is really cool stuff.\nLots and lots of fun to have in here.'

In [26]:
print(yyy)

This is stuff I typed into a file.
It is really cool stuff.
Lots and lots of fun to have in here.

In [27]:
# this one is like your scripts with argv
def print_two(*args):
    arg1, arg2 = args
    print(f"arg1: {arg1}, arg2: {arg2}")


# ok, that *args is actually pointless, we can just do this
def print_two_again(arg1, arg2):
    print(f"arg1: {arg1}, arg2: {arg2}")


# this just takes one argument
def print_one(arg1):
    print(f"arg1: {arg1}")


# this one takes no arguments
def print_none():
    print("I got nothin'.")


print_two("Zed", "Shaw")
print_two_again("Zed", "Shaw")
print_one("First!")
print_none()

arg1: Zed, arg2: Shaw
arg1: Zed, arg2: Shaw
arg1: First!
I got nothin'.

In [40]:
def xxx(*args):
    for xy in args:
        print(xy)
xxx('aaa','bbb','ccc','eee')

aaa
bbb
ccc
eee

In [44]:
print_two_again('lll')

TypeError: print_two_again() missing 1 required positional argument: 'arg2'

In [45]:
print_none()

I got nothin'.

In [48]:
def xxx(*args):
    for xy in args:
        print(xy)
xxx('aaa','ddd', 'ccc')

aaa
ddd
ccc

In [49]:
def cheese_and_crackers(cheese_count, boxes_of_crackers):
    print(f"You have {cheese_count} cheeses!")
    print(f"You have {boxes_of_crackers} boxes of crackers!")
    print("Man that's enought for a party!")
    print("Get a blanket.\n")

#print('Joshi')

print("We can just give the function numbers directly:")
cheese_and_crackers(20, 30)

print("OR, we can use variables from our script:")
amount_of_cheese = 10
amount_of_crackers = 50

cheese_and_crackers(amount_of_cheese, amount_of_crackers)

print("We can even do math inside too:")
cheese_and_crackers(10 + 20, 5 + 6)

print("And we can combine the two, variables and math:")
cheese_and_crackers(amount_of_cheese + 100, amount_of_crackers + 1000)

We can just give the function numbers directly:
You have 20 cheeses!
You have 30 boxes of crackers!
Man that's enought for a party!
Get a blanket.

OR, we can use variables from our script:
You have 10 cheeses!
You have 50 boxes of crackers!
Man that's enought for a party!
Get a blanket.

We can even do math inside too:
You have 30 cheeses!
You have 11 boxes of crackers!
Man that's enought for a party!
Get a blanket.

And we can combine the two, variables and math:
You have 110 cheeses!
You have 1050 boxes of crackers!
Man that's enought for a party!
Get a blanket.

In [50]:
cheese_and_crackers(20, 30)

You have 20 cheeses!
You have 30 boxes of crackers!
Man that's enought for a party!
Get a blanket.

In [51]:
cheese_and_crackers(amount_of_cheese, amount_of_crackers)

You have 10 cheeses!
You have 50 boxes of crackers!
Man that's enought for a party!
Get a blanket.

In [52]:
cheese_and_crackers(amount_of_cheese + 100, amount_of_crackers + 1000)

You have 110 cheeses!
You have 1050 boxes of crackers!
Man that's enought for a party!
Get a blanket.

In [54]:
from sys import argv

script, xxx, input_file = argv


def print_all(f):
    print(f.read())


def rewind(f):
    f.seek(0)


def print_a_line(line_count, f):
    print(line_count, f.readline())


current_file = open(input_file)

print("First let's print the whole file:\n")

print_all(current_file)

print("Now let's rewind, kind of like a tape.")

rewind(current_file)

print("Let's print three lines:")

current_line = 1
print_a_line(current_line, current_file)

current_line = current_line + 1
print_a_line(current_line, current_file)

current_line = current_line + 1
print_a_line(current_line, current_file)

current_line = current_line + 1
print_a_line(current_line, current_file)

First let's print the whole file:

{
  "shell_port": 48549,
  "iopub_port": 55611,
  "stdin_port": 47187,
  "control_port": 53661,
  "hb_port": 38727,
  "ip": "127.0.0.1",
  "key": "de31e398-3a0fc7f8b536c9111a096bdf",
  "transport": "tcp",
  "signature_scheme": "hmac-sha256",
  "kernel_name": ""
}
Now let's rewind, kind of like a tape.
Let's print three lines:
1 {

2   "shell_port": 48549,

3   "iopub_port": 55611,

4   "stdin_port": 47187,

In [59]:
def add(a, b):
    print(f"ADDING {a} + {b}")
    return a + b


def subtract(a, b):
    print(f"SUBTRACTING {a} - {b}")
    return a - b


def multiply(a, b):
    print(f"MULTIPLYING {a} * {b}")
    return a * b


def divide(a, b):
    print(f"DIVIDING {a} / {b}")
    return a / b


print("Let's do some math with just functions!")

age = add(30, 5)
height = subtract(78, 4)
weight = multiply(90, 2)
iq = divide(100, 2)

print(f"Age: {age}, Height: {height}, Weight: {weight}, IQ: {iq}")

# A puzzle for the extra credit, type it in anyway.
print("Here is a puzzle.")

what = 35+ 74-180*25
print("That becomes: ", what, "Can you do it by hand?")

Let's do some math with just functions!
ADDING 30 + 5
SUBTRACTING 78 - 4
MULTIPLYING 90 * 2
DIVIDING 100 / 2
Age: 35, Height: 74, Weight: 180, IQ: 50.0
Here is a puzzle.
That becomes:  -4391 Can you do it by hand?

In [57]:
x = add(99,1222)

ADDING 99 + 1222

In [58]:
x

1321

In [60]:
print("Let's practice everything.")
print('You\'d need to know \'bout escapes with \\ that do:')
print('\n newlines and \t tabs.')

poem = """
\tThe lovely world
with logic so firmly planted
cannot discern \n the needs of love
nor comprehend passion from intuition
and requires an explanation
\n\t\twhere there is none.
"""

print("--------------")
print(poem)
print("--------------")

five = 10 - 2 + 3 - 6
print(f"This should be five: {five}")


def secret_formula(started):
    jelly_beans = started * 500
    jars = jelly_beans / 1000
    crates = jars / 100
    return jelly_beans, jars, crates


start_point = 10000
beans, jars, crates = secret_formula(10000)

# remember that this is another way to format string
print("With a starting point of: {}".format(start_point))
# it's just like with an f"" string
print(f"We'd have {beans} beans, {jars} jars, and {crates} crates.")

start_point = start_point / 10

print("We can also do that this way:")
formula = secret_formula(start_point)
# this is an easy way to apply a list to a format string
print("We'd have {} beans, {} jars, and {} crates.".format(*formula))

Let's practice everything.
You'd need to know 'bout escapes with \ that do:

 newlines and 	 tabs.
--------------

	The lovely world
with logic so firmly planted
cannot discern
 the needs of love
nor comprehend passion from intuition
and requires an explanation

		where there is none.

--------------
This should be five: 5
With a starting point of: 10000
We'd have 5000000 beans, 5000.0 jars, and 50.0 crates.
We can also do that this way:
We'd have 500000.0 beans, 500.0 jars, and 5.0 crates.

In [61]:
def break_words(stuff):
    """This function will break up words for us."""
    words = stuff.split(' ')
    return words


def sort_words(words):
    """Sorts the words."""
    return sorted(words)


def print_first_word(words):
    """Prints the first word after popping it off."""
    word = words.pop(0)
    print(word)


def print_last_word(words):
    """Prints the last word after popping it of."""
    word = words.pop(-1)
    print(word)


def sort_sentence(sentence):
    """Takes in a full sentence and returns the sorted words."""
    words = break_words(sentence)
    return (sort_words(words))


def print_first_and_last(sentence):
    """Prints the first and last words of a sentence."""
    words = break_words(sentence)
    print_first_word(words)
    print_last_word(words)


def print_first_and_last_sorted(sentence):
    """Sorts the words then prints the first and last one."""
    words = sort_sentence(sentence)
    print_first_word(words)
    print_last_word(words)

In [69]:
x = "hello,how,are,you".split(',')

In [70]:
x[0]

'hello'

In [72]:
len(x)

4

In [73]:
x.pop()

'you'

In [74]:
x

['hello', 'how', 'are']

In [76]:
y = sort_words(x)

['are', 'hello', 'how']

In [77]:
people = 20
cats = 30
dogs = 15

if people <= cats:
    print("Too many cats! The world is doomed!")
    print('Joshi')
    
if people > cats:
    print("Not many cats! The world is saved!")

if people < dogs:
    print("The world is drooled on!")

if people > dogs:
    print("The world is dry!")

dogs += 5

if people >= dogs:
    print("People are greater than or equal to dogs.")

if people <= dogs:
    print("People are less than or equal to dogs.")

if people == dogs:
    print("People are dogs.")

Too many cats! The world is doomed!
Joshi
The world is dry!
People are greater than or equal to dogs.
People are less than or equal to dogs.
People are dogs.

In [78]:
people = 30
cars = 40
trucks = 15

if cars > people:
    print("We should take the cars.")
elif cars < people:
    print("We should not take the cars.")
else:
    print("We can't decide.")

if trucks > cars:
    print("That's too many trucks.")
elif trucks < cars:
    print("Maybe we could take the trucks.")
else:
    print("We still can't decide.")

if people > trucks:
    print("Alright, let's just take the trucks.")
else:
    print("Fine, let's stay home then.")

We should take the cars.
Maybe we could take the trucks.
Alright, let's just take the trucks.

In [81]:
1==1

True

In [82]:
print("You enter a dark room with two doors.")
print("Do you go through door #1 or door #2?")

door = input("> ")

if door == "1":
    print("There's a giant bear here eating a cheese cake.")
    print("What do you do?")
    print("1. Take the cake.")
    print("2. Scream at the bear.")

    bear = input("> ")

    if bear == "1":
        print("The bear eats your face off. Good job!")
    elif bear == "2":
        print("The bear eats your legs off. Good job!")
    else:
        print(f"Well, doing {bear} is probably better.")
        print("Bear runs away.")

elif door == "2":
    print("You stare into the endless abyss at Cthulhu's retina.")
    print("1. Blueberries.")
    print("2. Yellow jacket clothespins.")
    print("3. Understanding revolvers yelling melodies.")

    insanity = input("> ")

    if insanity == "1" or insanity == "2":
        print("Your body survives powered by a mind of jello.")
        print("Good job!")
    else:
        print("The insanity rots your eyes into a pool of muck.")
        print("Good job!")

else:
    print("You stumble around and fall on knife and die. Good job!")

You enter a dark room with two doors.
Do you go through door #1 or door #2?
> 1
There's a giant bear here eating a cheese cake.
What do you do?
1. Take the cake.
2. Scream at the bear.
> 1
The bear eats your face off. Good job!

#

In [83]:
the_count = [1, 2, 3, 4, 5]
fruits = ['apples', 'oranges', 'pears', 'apricots']
change = [1, 'pennies', 2, 'dimes', 3, 'quarters']

# this first kind of for-loop goes through a list
for number in the_count:
    print(f"This is count {number}")

# same as above
for fruit in fruits:
    print(f"A fruit of type: {fruit}")

# also we can go through mixed lists too
# notice we have to use %r since we don't know what's in items
for i in change:
    print(f"I got {i}")

# we can also build lists, first start with an empty one
elements = []

# then use the range function to do 0 to 5 counts
for i in range(0, 6):
    print(f"Adding {i} to the list.")
    # append is a function that lists understand
    elements.append(i)

# now we can print them out too
for i in elements:
    print(f"Element was: {i}")

This is count 1
This is count 2
This is count 3
This is count 4
This is count 5
A fruit of type: apples
A fruit of type: oranges
A fruit of type: pears
A fruit of type: apricots
I got 1
I got pennies
I got 2
I got dimes
I got 3
I got quarters
Adding 0 to the list.
Adding 1 to the list.
Adding 2 to the list.
Adding 3 to the list.
Adding 4 to the list.
Adding 5 to the list.
Element was: 0
Element was: 1
Element was: 2
Element was: 3
Element was: 4
Element was: 5

In [89]:
the_count = [10, 20, 30, 40, 50]

for xxx in the_count:
    print(xxx-1)

9
19
29
39
49

In [92]:
for i in range(0, 3):
    print(i)

0
1
2

In [96]:
# we can also build lists, first start with an empty one
elements = []

# then use the range function to do 0 to 5 counts
for p in range(0, 6):
    print(f"Adding {p} to the list.")
    # append is a function that lists understand
    elements.append(p)

Adding 0 to the list.
Adding 1 to the list.
Adding 2 to the list.
Adding 3 to the list.
Adding 4 to the list.
Adding 5 to the list.

In [94]:
elements

[0, 1, 2, 3, 4, 5]

In [97]:
xxx =range(0, 6)
print (xxx)
list(xxx)

range(0, 6)

[0, 1, 2, 3, 4, 5]

In [106]:
i = 0
numbers = []

while i < 6:
    print(f"At the top i is {i}")
    numbers.append(i)

    i = i + 1
    print("Numbers now: ", numbers)
    print(f"At the bottom i is {i}")

print("The numbers: ")

for xxx in numbers:
    print(xxx)

At the top i is 0
Numbers now:  [0]
At the bottom i is 1
At the top i is 1
Numbers now:  [0, 1]
At the bottom i is 2
At the top i is 2
Numbers now:  [0, 1, 2]
At the bottom i is 3
At the top i is 3
Numbers now:  [0, 1, 2, 3]
At the bottom i is 4
At the top i is 4
Numbers now:  [0, 1, 2, 3, 4]
At the bottom i is 5
At the top i is 5
Numbers now:  [0, 1, 2, 3, 4, 5]
At the bottom i is 6
The numbers:
0
1
2
3
4
5

In [105]:
i=0
li = [2,3,5,67,85,5,4]
max = len(li)
while i < max:
    print (li[i])
    i=i+1

2
3
5
67
85
5
4

In [107]:
# create a mapping of state to abbreviation
states = {
    'Oregon': 'OR',
    'Florida': 'FL',
    'California': 'CA',
    'New York': 'NY',
    'Michigan': 'MI'
}

# create a basic set of states and some cities in them
cities = {'CA': 'San Francisco',
          'MI': 'Detroit',
          'FL': 'Jacksonville'}

# add some more cities
cities['NY'] = 'New York'
cities['OR'] = 'Portland'

# print out some cities
print('-' * 10)
print("NY State has: ", cities['NY'])
print("OR State has: ", cities['OR'])

# print some states
print('-' * 10)
print("Michigan's abbreviation is: ", states["Michigan"])
print("Florida's abbreviation is: ", states['Florida'])

# do it by using the state then cities dict
print('-' * 10)
print("Michigan has: ", cities[states['Michigan']])
print("Florida has: ", cities[states['Florida']])

# print every state abbreviation
print('-' * 10)
for state, abbrev in states.items():
    print(f"{state} is abbreviated {abbrev}")

# print every city in state
print('-' * 10)
for abbrev, city in cities.items():
    print(f"{abbrev} has the city {city}")

# now do both at the same time
print('-' * 10)
for state, abbrev in states.items():
    print(f"{state} state is abbreviated {abbrev}")
    print(f"and has city {cities[abbrev]}")

print('-' * 10)
# safely get an abbreviation by state that might not be there
state = states.get('Texas')

if not state:
    print("Sorry, no Texas.")

# get a city with a default values
city = cities.get('TX', 'Does not Exist')
print(f"The city for the state 'TX' is: {city}")

----------
NY State has:  New York
OR State has:  Portland
----------
Michigan's abbreviation is:  MI
Florida's abbreviation is:  FL
----------
Michigan has:  Detroit
Florida has:  Jacksonville
----------
Oregon is abbreviated OR
Florida is abbreviated FL
California is abbreviated CA
New York is abbreviated NY
Michigan is abbreviated MI
----------
CA has the city San Francisco
MI has the city Detroit
FL has the city Jacksonville
NY has the city New York
OR has the city Portland
----------
Oregon state is abbreviated OR
and has city Portland
Florida state is abbreviated FL
and has city Jacksonville
California state is abbreviated CA
and has city San Francisco
New York state is abbreviated NY
and has city New York
Michigan state is abbreviated MI
and has city Detroit
----------
Sorry, no Texas.
The city for the state 'TX' is: Does not Exist

In [112]:
states = {
    'Oregon': ['OR' ,'OO'],
    'Florida': 'FL',
    'California': 'CA',
    'New York': 'NY',
    'Michigan': 'MI'
}

In [113]:
states['Oregon']

['OR', 'OO']

In [116]:
for key, value in states.items():
    print(f"Key is {key} value is {value}")

Key is Oregon value is ['OR', 'OO']
Key is Florida value is FL
Key is California value is CA
Key is New York value is NY
Key is Michigan value is MI

In [121]:
a = [1, 2, 3]
b=a.copy()

In [122]:
a.append(4)
b

[1, 2, 3]

In [125]:
a = 5.01
b=1
c=a*b
type(c)

float

In [126]:
a = 'foo'

In [127]:
getattr(a, 'split')

In [128]:
def isiterable(obj):
    try:
        iter(obj)
        return True
    except TypeError: # not iterable
        return False

In [129]:
isiterable('a string')

True

In [130]:
isiterable([1, 2, 3])

True

In [131]:
iter([1, 2, 3])

In [133]:
iter(5)

TypeError: 'int' object is not iterable

In [134]:
isiterable([5,6])

True

In [142]:
a = [1, 2, 3]
b = a
c = list(a)

In [143]:
#a.append('108')

In [144]:
a

[1, 2, 3]

In [145]:
b

[1, 2, 3]

In [146]:
c

[1, 2, 3]

In [147]:
a is b

True

In [148]:
a is c

False

In [150]:
a==c

True

In [151]:
a = None

In [153]:
print(a)

None

In [154]:
a

In [158]:
a_list = ['foo', 2, [4, 5]]
a_list[2] = (3, 4)
a_list

['foo', 2, (3, 4)]

In [161]:
a_list[2] = 5

In [162]:
a_list

['foo', 2, 5]

In [163]:
s = '3.14159'
fval = float(s)
fval

3.14159

In [164]:
type(fval)

float

In [171]:
bool(None)

False

In [177]:
type(1+2)

int

In [193]:
from datetime import datetime, date, time
dt = datetime(2011, 10, 29, 20, 30, 21)
dt.day

29

In [180]:
dt.minute

30

In [181]:
dt.date()

datetime.date(2011, 10, 29)

In [182]:
dt.time()

datetime.time(20, 30, 21)

In [183]:
dt

datetime.datetime(2011, 10, 29, 20, 30, 21)

In [184]:
dt.strftime('%m/%d/%Y %H:%M')

'10/29/2011 20:30'

In [189]:
datetime.strptime('10/31/2009', '%m/%d/%Y')

datetime.datetime(2009, 10, 31, 0, 0)

In [194]:
dt.replace(minute=0, second=0)

datetime.datetime(2011, 10, 29, 20, 0)

In [195]:
for i in range(4):
    for j in range(4):
        if j > i:
            break
        print((i, j))

(0, 0)
(1, 0)
(1, 1)
(2, 0)
(2, 1)
(2, 2)
(3, 0)
(3, 1)
(3, 2)
(3, 3)

In [197]:
list(range(1, 20, 2))

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [204]:
x = 5

In [202]:
if x >= 0:
    y = 'Non-negative'
else:
    y = 'Negative'

In [205]:
y = 'Non-negative' if x >= 0 else 'Negative'

In [206]:
y

'Non-negative'

In [207]:
#List comprehension

In [208]:
import pandas as pd

/home/nbuser/anaconda3_501/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/home/nbuser/anaconda3_501/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [209]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/matplotlib/font_manager.py:281: UserWarning: Matplotlib is building the font cache using fc-list. This may take a moment.
  'Matplotlib is building the font cache using fc-list. '

In [210]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [214]:
frame.dtypes

pop      float64
state     object
year       int64
dtype: object

In [215]:
type(frame)

pandas.core.frame.DataFrame

In [213]:
data['state'][0]

'Ohio'

In [217]:
frame.head(3)
#select top 3 from frame

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

In [218]:
type(data)

dict

In [219]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [220]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [221]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [223]:
frame2[['state']]
#Access anythig inside an object - []

        state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada
six    Nevada

In [224]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [227]:
frame2.loc[['three']]

       year state  pop debt
three  2002  Ohio  3.6  NaN

In [225]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [229]:
frame2.iloc[[2]]

       year state  pop debt
three  2002  Ohio  3.6  NaN

In [231]:
frame2['debt']  = 16.5

In [234]:
frame2.debt

[one      16.5
 two      16.5
 three    16.5
 four     16.5
 five     16.5
 six      16.5
 Name: debt, dtype: float64]

In [238]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [240]:
frame2.dtypes

year       int64
state     object
pop      float64
debt       int64
dtype: object

In [241]:
del frame2['debt']

In [242]:
frame2.columns

Index(['year', 'state', 'pop'], dtype='object')

In [245]:
frame2.T.T

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [246]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [247]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [248]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [250]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [252]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [255]:
np.arange(9).reshape((3, 3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [256]:
states = ['Texas', 'Utah', 'California']

In [257]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [258]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [264]:
frame.iloc[[0,1,2], [0,1,2]]

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [262]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [265]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [266]:

data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [270]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [273]:
data[ data < 5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [275]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [277]:
data.iloc[:3, :3]

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10

In [278]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [279]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [280]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [281]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [288]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=['b','d','e'],
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

frame = np.abs(frame)
frame

               b         d         e
Utah    0.331286  1.349742  0.069877
Ohio    0.246674  0.011862  1.004812
Texas   1.327195  0.919262  1.549106
Oregon  0.022185  0.758363  0.660524

In [292]:
#f = lambda x: x.max()
frame.apply(lambda x: x.max(), axis =1)

Utah      1.349742
Ohio      1.004812
Texas     1.549106
Oregon    0.758363
dtype: float64

In [286]:
def f2(x):
    return x.max()

In [298]:
format = lambda x: '%.f' % x
frame.applymap(format)

        b  d  e
Utah    0  1  0
Ohio    0  0  1
Texas   1  1  2
Oregon  0  1  1

In [299]:
frame['e'].map(format)

Utah      0
Ohio      1
Texas     2
Oregon    1
Name: e, dtype: object

In [300]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [301]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [303]:
df['sumax'] = df.sum(axis='columns')
df

    one  two  sumax
a  1.40  NaN   1.40
b  7.10 -4.5   2.60
c   NaN  NaN   0.00
d  0.75 -1.3  -0.55

In [304]:
df.describe()

            one       two     sumax
count  3.000000  2.000000  4.000000
mean   3.083333 -2.900000  0.862500
std    3.493685  2.262742  1.419727
min    0.750000 -4.500000 -0.550000
25%    1.075000 -3.700000 -0.137500
50%    1.400000 -2.900000  0.700000
75%    4.250000 -2.100000  1.700000
max    7.100000 -1.300000  2.600000